# SetClTextureD

## Description
Procedure SetClTextureD sets the roof dormer texture of the specified class.

```pascal
PROCEDURE SetClTextureD(
				className  : STRING;
				textureRef : LONGINT);
```

```python
def vs.SetClTextureD(className, textureRef):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Class name.|
|textureRef|LONGINT|Texture reference index value.|

## Remarks
Sets the roof dormer texture of the class named className.

## Examples
```pascal
SetClTextureD('Wall', 1);
```
```python
import vs

# Procedure SetClTextureD sets the roof dormer texture of the specified class.
className = 'None'
textureRef = 1

vs.SetClTextureD(className, textureRef)
```

## Version
Availability: from VectorWorks8.0

## Category
* Textures